{
  "language": "Lang",
  "welcomeLink": "Welcome",
  "mainLink": "Main",
  "signOut": "Sign Out",
  "signIn": "Sign In",
  "signUp": "Sign Up",
  "haveAnAccount": "Already have an account?",
  "email": "Email address",
  "password": "Password",
  "confirmPassword": "Confirm Password",
  "forgotPassword": "Forgot password?",
  "noAccount": "Need an account?",
  "resetPassword": "Reset your password",
  "resetPasswordMessage": "Enter your email address and we will send you a link to reset your password.",
  "send": "Send",
  "strongPassword": "Strong Password",
  "weakPassword": "Weak Password",
  "created": "Created in",
  "copyright": "All rights reserved",
  "role": "Role",
  "age": "Age",
  "personality": "Personality",
  "persons": [
    {
      "name": "Tischenko Vladislav",
      "role": "Chief Coordinator",
      "age": 35,
      "personality": "Spirited and happily married",
      "presentation": "<p>My main role in the team was to maintain <strong>morale</strong> and a <strong>positive atmosphere</strong>. In this project, I took on responsibilities for implementation:</p><ul><li>Managing routing and <strong>seamless redirection</strong> to the main page.</li><li>Creating the Welcome page.</li><li>Implemented logic of monaco-editor/react in all windows.</li><li>Implemented prettifying in the query editor.</li><li>Developed the AboutUs component.</li><li>Implemented authentication using Firebase.</li><li>Ensuring <strong>test coverage</strong>.</li></ul><p>I would like to express my deep <strong>gratitude</strong> to my outstanding colleagues. Each one of you is truly exceptional, and I consider myself incredibly fortunate to have the privilege of working with such an outstanding team.</p><p>Olya, your leadership skills are <strong>outstanding</strong>, and your friendship is truly treasured. Thank you for your invaluable <strong>support</strong> and <strong>unwavering patience</strong>.</p><p>Vika, you possess the <strong>sharpest mind</strong> I've ever encountered (I still have my doubts that you're human). Your ability to tackle the most daunting challenges with ease leaves me in awe. Vika, you are our <strong>superhero</strong>, and our achievements would not have been possible without you.</p><p>I want to extend my heartfelt <strong>thanks</strong> to all of you for your <strong>unwavering dedication</strong> and <strong>hard work</strong>. Our journey together has been nothing short of <strong>incredible</strong>, and I eagerly anticipate achieving even greater success as we continue to work together in the future.</p>",
      "videoSource": "./assets/video/vlad.mp4",
      "gitHubLink": "https://github.com/wellder00/"
    },
    {
      "name": "Victoria Alekseeva",
      "role": "Commercetools explorer",
      "age": "34",
      "personality": "keep calm and don't panic",
      "presentation": "<p>¡Hola! I'm Victoria, a telecommunications engineer by education who decided to change her profession. </p><p>In this project, my responsibilities included:</p><ul><li>Developing the application login component.</li><li>Developing the registration component.</li><li>Implementing client-side form validation.</li><li>Adding a request to get the schema.</li><li>Localization of the application.</li><li>Implementing the response window.</li><li>Code editor queries.</li><li>Ensuring <strong>test coverage</strong>.</li></ul><p>During my learning process, I was incredibly lucky to meet Olga and Vlad. While working on the project, we were always in touch, had daily calls to discuss tasks and issues, and found solutions together. You guys are amazing!</p><p>Vlad, nothing is impossible for you, and your phrases during our calls, 'I won't try; I will do it!' were incredibly motivating.</p><p>Olga, your support and energy drove our team forward, despite all the challenges and unclear moments during the implementation.</p><p>Thank you for the time we spent together. I hope we'll have the opportunity to work together again in our wonderful team.</p>",
      "videoSource": "./assets/video/vika.mp4",
      "gitHubLink": "https://github.com/VictoriaAlekseeva"
    },
    {
      "name": "Zhyzhka Olga",
      "role": "Team Lead / Frontend Developer",
      "age": 46,
      "personality": "always striving for new knowledge and achievements",
      "presentation": "<p>Hello, my name is Olga Zhizhka.</p><p>In this project, I served as the team lead. My main responsibilities included: <ul><li>Design, layout, and development of React components logic.</li><li>Integration of Redux into the project for centralizing component state and data management.</li><li>Creation of the project structure and installation of the build system.</li><li>Implementation of <strong>registration and login notifications</strong>.</li><li>Completed tasks for Header and Footer components.</li><li>Implemented URL input.</li><li>Implemented Variables and Headers components.</li><li>Introduced authentication service errors.</li><li>Implemented panel resizing and variable analysis for queries.</li><li>Implemented adaptive design.</li><li>Validation of API input field, error handling, and styling of components.</li><li>Ensured <strong>test coverage</strong>.</li></ul> As a team lead, my main challenge was to motivate the team, organize systematic work, ensure a comfortable process, and regulate the pace of task execution by all team members.</p><p>Our team followed the Agile methodology, used GitHub Projects for task organization and development process management, utilized Miro for brainstorming and joint meetings, and relied on Discord for workspace and meetings. Throughout the project, we practically lived there! During our meetings, we coded, conducted code reviews, discussed tasks, and tested our work. I am grateful to my team. Over time, we became very cohesive and managed to structure the process in such a way that any of us could step into another's role if needed. Each one of us delved into each other's tasks but still managed our responsibilities. I appreciate the contribution of every team member; we were able to complete our project primarily due to trust and coordinated teamwork.</p>",
      "videoSource": "./assets/video/olga.mp4",
      "gitHubLink": "https://github.com/HelgaZhizhka"
    }
  ]
}
