{
  "language": "Язык",
  "welcomeLink": "Добро пожаловать",
  "welcomeHeader": "Добро пожаловать в GRAPHIQL",
  "welcomePageCreatersInfo": "Проект создан командой Yes Code",
  "comingSoon": "Для загрузки документации нажмите кнопку Схема",
  "teamMotto": "Один за всех и все за одного!",
  "mainLink": "Главная",
  "signOut": "Выйти",
  "signIn": "Войти",
  "signUp": "Зарегистрироваться",
  "haveAnAccount": "Уже есть аккаунт?",
  "email": "Email",
  "password": "Пароль",
  "confirmPassword": "Подтвердить пароль",
  "forgotPassword": "Забыли пароль?",
  "noAccount": "Еще не зарегистрированы?",
  "resetPassword": "Сбросить пароль",
  "resetPasswordMessage": "Введите адрес электронной почты и мы отправим ссылку для сброса пароля",
  "send": "Отправить",
  "labelInputApi": "Введите URL-адрес API с поддержкой CORS",
  "buttonConnect": "OK",
  "buttonSchema": "Схема",
  "tabsTitleVariables": "Переменные",
  "tabsTitleHeaders": "Заголовки",
  "titleEditor": "Редактор запросов",
  "titleResponse": "Ответ",
  "schemaTitle": "Открыть",
  "documentationTitle": "Документация",
  "documentationSubTitle": "Схема GraphQL предоставляет тип для каждого вида операций.",
  "strongPassword": "Сильный пароль",
  "weakPassword": "Слабый пароль",
  "created": "Создано в",
  "copyright": "Все права зарегистрированы",
  "role": "Роль",
  "age": "Лет",
  "personality": "Характер",
  "persons": [
    {
      "name": "Тищенко Владислав",
      "role": "Главный координатор",
      "age": 35,
      "personality": "Характер норовливый, женат",
      "presentation": "<p>Моя основная роль в команде заключалась в поддержании <strong>боевого духа</strong> и <strong>позитивной атмосферы</strong>. В рамках этого проекта я взял на себя обязанности по реализации:</p><ul><li>Управление маршрутизацией и <strong>редиректом</strong> на главную страницу.</li><li>Создание страницы Welcome</li><li>Внедрил логику monaco-editor/react во все окна</li><li>Реализовал prettifying в редакторе запросов</li><li>Разработал компонент AboutUs</li><li>Внедрил аутентификацию с помощью Firebase</li><li>Обеспечение <strong>тестового покрытия</strong>.</li></ul><p>Я хотел бы выразить свою глубокую <strong>благодарность</strong> своим выдающимся коллегам. Каждый из вас по-настоящему исключителен, и я считаю себя невероятно удачливым иметь привилегию работать вместе с такой выдающейся командой.</p><p>Оля, твои навыки лидерства - <strong>выдающиеся</strong>, и твоя дружба - по-настоящему драгоценна. Спасибо за твою бесценную <strong>поддержку</strong> и <strong>неизменное терпение</strong>.</p><p>Вика, у тебя <strong>самый ясный ум</strong>, с которым мне когда-либо доводилось сталкиваться (я все еще сомневаюсь, что ты человек). Твоя способность легко справляться с самыми сложными задачами заставляет меня восхищаться. Вика, ты - наш <strong>супергерой</strong>, и наши достижения не были бы возможны без тебя.</p><p>Я хочу выразить свою искреннюю <strong>благодарность</strong> всем вам за ваше <strong>неизменное преданность</strong> и <strong>труд</strong>. Наше совместное путешествие было нечто <strong>невероятное</strong>, и с нетерпением жду еще больших успехов, продолжая работать вместе в будущем.</p>",
      "videoSource": "./assets/video/vlad.mp4",
      "gitHubLink": "https://github.com/wellder00/"
    },
    {
      "name": "Виктория Алексеева",
      "role": "Исследователь GraphQL",
      "age": "34",
      "personality": "Сохраняйте спокойствие и не паникуйте",
      "presentation": "<p>¡Hola! Я Виктория, инженер по телекоммуникациям по образованию, решившая изменить свою профессию. </p><p>В этом проекте мои обязанности включали в себя:</p><ul><li>Разработка компонента входа в приложение.</li><li>Разработка компонента регистрации.</li><li>Внедрение валидации форм на стороне клиента.</li><li>Добавление запроса на получение схемы.</li><li>Локализация приложения.</li><li>Реализация окна ответов.</li><li>Запросы на редактор кода.</li><li>Обеспечение <strong>тестового покрытия</strong>.</li></ul><p>В процессе обучения мне повезло познакомиться с Ольгой и Владом. Во время работы над проектом мы всегда были на связи, проводили ежедневные звонки для обсуждения задач и проблем, и находили решения вместе. Вы - удивительные ребята!</p><p>Влад, для тебя нет ничего невозможного, и твои фразы во время наших звонков, 'Я не буду пытаться, Я сделаю это!' были невероятно мотивирующими.</p><p>Ольга, твоя поддержка и энергия вели нашу команду вперед, несмотря на все трудности и неясные моменты во время разработки.</p><p>Спасибо за время, проведенное вместе. Надеюсь, у нас еще будет возможность поработать вместе в нашей замечательной команде.</p>",
      "videoSource": "./assets/video/vika.mp4",
      "gitHubLink": "https://github.com/VictoriaAlekseeva"
    },
    {
      "name": "Жижка Ольга",
      "role": "Руководитель команды / Frontend разработчик",
      "age": 46,
      "personality": "Всегда стремящаяся к новым знаниям и достижениям",
      "presentation": "<p>Привет, меня зовут Ольга Жижка.</p><p>В этом проекте я выступала в роли руководителя команды. Мои основные обязанности включали в себя: <ul><li>Дизайн, верстку и разработку логики React-компонентов.</li><li>Внедрение Redux в проект для централизации состояния компонентов и управления данными.</li><li>Создание структуры проекта и установку системы сборки.</li><li>Реализация <strong>уведомлений о регистрации и входе.</strong>.</li><li>Реализовала все задачи по Header и Footer компонентам.</li><li>Реализовала ввод URL-адреса.</li><li>Реализовала компоненты Variables и Headers.</li><li>Внедрила ошибки служб аутентификации</li><li>Реализовала изменение размера панелей и анализ переменных для запроса</li><li>Реализовала адаптивный дизайн</li><li>Валидация поля ввода апи, обработка ошибок, стилизация компонентов</li><li>Обеспечение <strong>тестового покрытия</strong>.</li></ul>   В роли руководителя команды моим основным вызовом было мотивировать команду, организовывать систематическую работу, обеспечивать комфортный процесс и регулировать темп выполнения задач всеми членами команды.</p><p>Наша команда следовала методологии Agile и использовала GitHub Projects для организации задач и управления процессом разработки, Miro для мозгового штурма и совместных встреч, и канал Discord в качестве нашего основного рабочего пространства и для встреч - можно сказать, что мы практически жили там в течение всего проекта! Во время наших встреч мы писали код, проводили код-ревью, обсуждали задачи и тестировали нашу работу. Я благодарна своей команде. Cо временем мы стали очень сплоченными и смогли структурировать процесс так, что каждый из нас мог занять место другого, если это было нужно. Каждый из нас погружался в задачи других, но при этом управлял своими обязанностями. Я ценю вклад каждого члена команды; мы смогли завершить наш проект в первую очередь благодаря доверию и согласованной работе команды.</p>",
      "videoSource": "./assets/video/olga.mp4",
      "gitHubLink": "https://github.com/HelgaZhizhka"
    }
  ]
}
